# StairSetConstType

## Description
Sets construction Type of stair - not recommended for use

```pascal
FUNCTION StairSetConstType(
				stair            : HANDLE;
				ConstructionType : INTEGER) : BOOLEAN;
```

```python

def vs.StairSetConstType(stair, ConstructionType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|ConstructionType|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs